antoineL/minix/commands/update_bootcfg/update_bootcfg.8
.\" Written by Antoine Leca
.Dd March 28, 2013
.Dt UPDATE_BOOTCFG 8
.Os MINIX
.Sh NAME
.Nm update_bootcfg
.Nd Create or udpate the configuration for the boot monitor
.Sh SYNOPSIS
.Nm
.Op Fl r Ar rootdev
.Op Fl o Ar target
.Sh DESCRIPTION
The
.Nm
command recreates the configuration file used by
MINIX boot monitor. It is created from two templates,
.Pa /etc/boot.cfg.default
and
.Pa /etc/boot.cfg.local ;
the former is updated when the system changes,
while the latter holds the local modifications.
The templates obey the syntax for
.Xr boot.cfg 5 .
.Pp
The
.Fl o
option specifies the name of the new configuration file;
the default value is to update
.Pa /boot.cfg .
.Pp
The
.Pa /etc/boot.cfg.default
template expects the system images to reside in the
.Pa /boot/minix
directory, and that
.Pa /boot/minix_latest
points to last image, selected by the
.Cm default=
command. Besides the directory to which points
.Pa /boot/minix_latest ,
all the directory entries within 
.Pa /boot/minix
are expected to be alternative system releases, and are given additional
.Em menu=
entries, with the basic parameters
.Va $rootdevname
and
.Va $args .
Template
.Cm menu=
entries for inexistant directories, or directories without
.Va kernel
file, are skipped; the
.Cm default=
option is adjusted to point to the same relative menu entry
in the original template. This allows a
.Cm default=
pointing to a local
.Cm menu=
in the 
.Pa /etc/boot.cfg.local
template to take precedence in the resulting
.Pa /boot.cfg ;
the
.Cm clear=
and
.Cm timeout=
values in the
.Pa /etc/boot.cfg.local
template also take preference.
.Pp
Within the templates, some variables can be used and will be
substituted by
.Nm
at run time. They are preceded by the dollar sign.
.Sy $rootdevname
is replaced with the name of the device holding the
root file system. What is considered the root file system is
determined from its device name, as indicated either by the value
of the
.Sy $ROOT
setting in the
.Pa /etc/boot.cfg.args
file if set, else from the currently mounted device;
this can be overriden with the
.Fl r
option, for example if / is mounted as ramdisk.
.Sy $args ,
which is intended to be at the end of the menu lines, is replaced
by the system environement values, as determined at install time
by the
.Xr setup 8
utility and stored in
.Pa /etc/boot.cfg.args
file.
.Pp
The
.Nm
command updates the root file system, which it assumes to be the file
system the
.Xr boot 8
monitor starts from; also it reads the configuration files from the
.Pa /etc
directory; both references to the root can be changed using
.Bd -unfilled -option indent -compact
.Cm chroot \fIdestdir\fB update_bootcfg \fIoptions...\fB
.Ed
like to operate on a different file system; more complex cases can
be handled setting different values for the
.Sy $boot
and
.Sy $mboot
environment variables; see the beginning of the script for details.
.Sh FILES
.Bl -tag -width /etc/boot.cfg.default -compact
.It Pa /boot.cfg
Location of the configuration file; previous content is lost
.It Pa /boot/minix/*
Directories with the various releases
.It Pa /boot/minix_default
Directory with the base release of MINIX, installed at
.Xr setup 8
time.
.It Pa /boot/minix_latest
Symbolic link to the directory with the latest release, usually
taken by default
.It Pa /etc/boot.cfg.args
Locally-defined system environment variables, initialised at
.Xr setup 8
time.
.It Pa /etc/boot.cfg.default
Default template
.It Pa /etc/boot.cfg.local
Locally-defined additional boot commands
.El
.Sh BUGS
.Pp
The presence of
.Pa /boot/minix_latest
as a
.Cm menu=
entry is not checked; it is assumed than one or several entries refer to it.
.Pp
While the script is intended to be portable among POSIX implementations,
it still uses
.Xr stat 1
and
.Xr readlink 1
which are not defined in the Standard.
.Pp
The
.Nm
does not provide a
.Fl N
option (similar to
.Xr install 1
or
.Xr mtree 8 )
to override the place where
.Pa /etc
configuration files are searched.
.Pp
The naming conventions, particularly the use of
.Em "default" ,
are not consistent.
.Sh SEE ALSO
.Xr boot 8 ,
.Xr boot.cfg 5 ,
.Xr setup 8 .
